import React from "react";
import Main from "../component/main";
import './abouttax.css'; // Adjust the path if necessary
import { Button } from "bootstrap";

function Abouttax() {
    return (
        <Main>
            <div className="container aboutpageformat">

                <p className="about-head-text-content kanit-regular">เงินได้ คืออะไร?</p>
                <p className="about-text-content kanit-light"> "เงินได้" คือสิ่งที่คล้ายกับคำว่า "รายได้" ที่เรารู้จักกันดีแต่มีขอบเขตที่กว้างกว่า ยกตัวอย่างเช่น หากเราทำงานและได้รับค่าตอบแทนเป็นเงิน นั่นถือว่าเป็นเงินได้อย่างแน่นอนแต่ถ้าเราทำงานและได้รับค่าตอบแทนเป็นของใช้ หรือแม้กระทั่งสิทธิ์ในการอยู่อาศัยโดยไม่ต้องเสียค่าเช่า
                    สิ่งเหล่านี้ก็ถือว่าเป็นเงินได้เช่นกันในทางภาษี เพราะ "เงินได้" หมายถึงรายได้ในรูปแบบของเงิน สิ่งของ หรือผลประโยชน์ที่สามารถตีมูลค่าเป็นตัวเงินได้ แม้กระทั่งเงินหรือผลประโยชน์ที่เราได้รับฟรีๆ ก็ยังนับว่าเป็นเงินได้ในมุมมองทางกฎหมาย
                    "เงินได้" ย่อมาจากคำว่า "เงินได้พึงประเมิน" ซึ่งครอบคลุมรายได้ที่เกิดขึ้นตลอดปีปฏิทิน ตั้งแต่วันที่ 1 มกราคม ถึง 31 ธันวาคม โดยสามารถแบ่งประเภทได้ดังนี้
                </p>
                <p className="about-text-content kanit-light">
                    <ol>
                        <li>เงินสด หรือรายได้ที่จ่ายมาในรูปแบบเงิน</li>
                        <li>ทรัพย์สิน หรือสิ่งของที่สามารถตีมูลค่าเป็นเงินได้</li>
                        <li>ผลประโยชน์อื่นๆ ที่มีมูลค่าทางการเงิน</li>
                        <li>ภาษีที่ผู้อื่นจ่ายให้แทนเรา</li>
                        <li>เครดิตภาษี ที่กฎหมายกำหนดว่าเรามีสิทธิได้รับ</li>
                    </ol>
                </p>

            </div>
        </Main >
    );
}

export default Abouttax;